Обработки/Reports/_КонтрольСроковДействияПаспортов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КонтрольСроковДействияПаспортов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиОповещений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КонтрольСроковДействияПаспортов/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Контроль сроков действия паспортов",
		"1.03",
		"",
		Истина);
	
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "Контроль", "Контроль сроков действия паспортов",, Ложь, "ВызовСерверногоМетода");

	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	//Начало сессии
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Организация");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + "/" + ИдентификаторКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполненияДляСбораСтатистики.Хранилище, ПараметрыВыполненияДляСбораСтатистики.Описание);

	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	Организация          = ПараметрыКоманды.Организация;
	ПолучателиОповещений = ПараметрыКоманды.ПолучателиОповещения;
	
	УстановитьПериодИВыполнитьКоманду(ИдентификаторКоманды);
	
	//Закрываем сессию
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры

Функция СформироватьЗапрос() Экспорт
	
	Запрос = Новый Запрос;	
	
	Справочники.ЮрФизЛица.ПоместитьКлиентовВМенеджерВременныхТаблиц(Запрос, ЭтотОбъект.Организация, ЭтотОбъект.Период);

	Запрос.УстановитьПараметр("Период", 					КонецДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("Возраст45", 					ДобавитьМесяц(ЭтотОбъект.Период, -45*12));
	Запрос.УстановитьПараметр("Организация", 				ЭтотОбъект.Организация);

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Клиенты.ЮрФизЛицо КАК ЮрФизЛицо,
		|	_Клиенты.Организация КАК Организация
		|ПОМЕСТИТЬ _ВсеКлиенты
		|ИЗ
		|	_Клиенты КАК _Клиенты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Договоры.Контрагент,
		|	Договоры.Организация
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Период, Организация = &Организация) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО Договоры.Ссылка = УсловияДоговоровОбщиеСрезПоследних.Договор
		|ГДЕ
		|	Договоры.Организация = &Организация
		|	И Договоры.ДатаЗаключения <= &Период
		|	И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &Период
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|	И Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Аренды)
		|	И Договоры.Контрагент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СрокиПаспортов.ЮрФизЛицо КАК ЮрФизЛицо,
		|	СрокиПаспортов.ФИО КАК ФИО,
		|	СрокиПаспортов.ДатаРождения КАК ДатаРождения,
		|	СрокиПаспортов.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиУдостоверенияЛичности,
		|	СрокиПаспортов.Гражданство КАК Гражданство,
		|	СрокиПаспортов.Возраст КАК Возраст,
		|	СрокиПаспортов.ДатаНачалаЗамены КАК ДатаНачалаЗамены,
		|	СрокиПаспортов.ДатаОкончанияЗамены КАК ДатаОкончанияЗамены,
		|	РАЗНОСТЬДАТ(&Период, СрокиПаспортов.ДатаОкончанияЗамены, ДЕНЬ) КАК ДнейДоОкончания
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|		РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК ФИО,
		|		РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения КАК ДатаРождения,
		|		РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности КАК ВидУдостоверенияЛичности,
		|		РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиУдостоверенияЛичности,
		|		РеквизитыФизическихЛицАнкетныеСрезПоследних.Гражданство КАК Гражданство,
		|		ВЫБОР
		|			КОГДА ДОБАВИТЬКДАТЕ(РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения, ГОД, РАЗНОСТЬДАТ(РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения, &Период, ГОД)) > &Период
		|				ТОГДА РАЗНОСТЬДАТ(РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения, &Период, ГОД) - 1
		|			ИНАЧЕ РАЗНОСТЬДАТ(РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения, &Период, ГОД)
		|		КОНЕЦ КАК Возраст,
		|		ДОБАВИТЬКДАТЕ(РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения, ГОД, ВЫБОР
		|				КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения <= &Возраст45
		|					ТОГДА 45
		|				ИНАЧЕ 20
		|			КОНЕЦ) КАК ДатаНачалаЗамены,
		|		ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения, ГОД, ВЫБОР
		|					КОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения <= &Возраст45
		|						ТОГДА 45
		|					ИНАЧЕ 20
		|				КОНЕЦ), ДЕНЬ, 90) КАК ДатаОкончанияЗамены
		|	ИЗ
		|		РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВсеКлиенты КАК _ВсеКлиенты
		|			ПО (_ВсеКлиенты.ЮрФизЛицо = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо)) КАК СрокиПаспортов
		|ГДЕ
		|	(СрокиПаспортов.ДатаВыдачиУдостоверенияЛичности < СрокиПаспортов.ДатаНачалаЗамены
		|			ИЛИ СрокиПаспортов.ДатаВыдачиУдостоверенияЛичности > &Период)
		|	И СрокиПаспортов.ДатаНачалаЗамены <= &Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	СрокиПаспортов.ФИО";

	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция СформироватьГипертекст(	Выборка = Неопределено) Экспорт
	
	Если Выборка = Неопределено Тогда
		Выборка = СформироватьЗапрос();
	КонецЕсли;
	
	НомерСтроки = 1;
	ТекстПисьма =""; 
	Пока Выборка.Следующий() Цикл
		ТекстПисьма = ТекстПисьма + //&nbsp; 
			"<tr>
			|	<td>" + НомерСтроки + "</td>
			|	<td><a href=" + ПолучитьНавигационнуюСсылкуИнформационнойБазы() + "#" + ПолучитьНавигационнуюСсылку(Выборка.ЮрФизЛицо) + ">" + Выборка.ФИО + "</a></td>
			|	<td>" + Формат(Выборка.ДатаРождения, "ДЛФ=Д") + "</td>
			|	<td>" + Выборка.Возраст + "</td>
			|	<td>" + Формат(Выборка.ДатаВыдачиУдостоверенияЛичности, "ДЛФ=Д") + "</td>
			|	<td>" + Формат(Выборка.ДатаОкончанияЗамены, "ДЛФ=Д") + "</td>
			|	<td class = """+ ?(Выборка.ДнейДоОкончания > 0 , "plus", "minus") + """>" + Выборка.ДнейДоОкончания + "</td>
			|</tr>";
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

	ТекстПисьма =
	"<html>
	|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
	|	<style>
	|		body {
	|			font: 10pt sans-serif;
	|		}
	|		table {
	|			text-align: center;
	|			border-spacing: 0;
	|			border-collapse: collapse;
	|		}
	|		td {
	|			font-size: 1em;
	|			border: 1px solid black;
	|			padding: 5px 20px 5px 20px;
	|		}
	|		.top {
	|			color: black;
	|			font-size: 15px;
	|			background: lightgrey;
	|		}
	|		.plus {
	|			color: green;
	|			font-size: 12px;
	|		}
	|		.minus {
	|			color: red;
	|			font-size: 12px;
	|		}
	|	</style>
	|</head>
	|<body>
	|<b>Отчет по проверке сроков замены паспортов за " + Формат(Период, "ДЛФ=Д") + "</b>
	|<br><br>
	|<table cols=""7""> 
	|<tr class=""top"">
	|<td>№№</td>
	|<td>ФИО</td>
	|<td>Дата рождения</td>
	|<td>Возраст</td>
	|<td>Дата выдачи<br>паспорта</td>
	|<td>Дата окончания<br>действия паспорта</td>
	|<td>Дней до замены<br>/ просрочен</td>
	|</tr>"
	+ ТекстПисьма + "</table></body></html>";
	
	Возврат ТекстПисьма;
КонецФункции

Процедура УстановитьПериодИВыполнитьКоманду(Команда)
	
	Период = ТекущаяДата();
	
	Выборка = СформироватьЗапрос();
	
	Если Выборка <> Неопределено И Выборка.Количество() > 0 И ЗначениеЗаполнено(ПолучателиОповещений) Тогда

		ТекстПисьма = СформироватьГипертекст(Выборка);
		
		РеквизитыОповещения = Новый Структура("Организация, Текст, Тема", ЭтотОбъект.Организация, ТекстПисьма, "Отчет по проверке сроков замены паспортов");
		Справочники.Оповещения.СформироватьОповещения("Отчет._КонтрольСроковДействияПаспортов", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);

	КонецЕсли;

КонецПроцедуры
